vvpai9/Keil/Keil_v5/ARM/Pack/.Web/GigaDevice.GD32F20x_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>GigaDevice</vendor>
  <url>https://gd32mcu.com/data/documents/pack/</url>
  <name>GD32F20x_DFP</name>
  <description>GigaDevice GD32F20x Series Device Support and Examples</description>
  <releases>
  <release version="2.2.3" date="2022-07-27">
    update url address.
  </release>
  <release version="2.2.2" date="2021-07-15">
    update I2C register CTL0 bit7.
    update I2C register STAT1 bit8 to bit15.
    delete USB DSTAT register ERR bit.
  </release>
  <release version="2.2.1" date="2020-12-15">
    update DBG_CTL register bit 17 to bit 20.
  </release>
  <release version="2.2.0" date="2020-09-08">
    update flash algorithm address range.
  </release>
  <release version="2.1.0" date="2018-11-02">
    update firmware of GD32F20x Device Family Pack.
  </release>
   <release version="2.0.0" date="2017-06-06">
    update firmware of GD32F20x Device Family Pack.
  </release>
  <release version="1.0.0" date="2017-04-18">
    First Release version of GD32F20x Device Family Pack.
  </release>
  </releases>
  <keywords>
  <!-- keywords for indexing -->
  <keyword>GigaDevice</keyword>
  <keyword>Device Support</keyword>
  <keyword>GD32F20x</keyword>
  </keywords>
  <devices>
    <family Dfamily="GD32F20x Series" Dvendor="GigaDevice:123">
      <processor Dcore="Cortex-M3"  Dfpu="0" Dmpu="0" Dendian="Little-endian"/>
      <description>
GD32 is a new 32-bit high performance, low power consumption universal microcontroller family powered by the ARM Cortex-M3 RISC core,which targeted at various MCU application areas.
GD32 family integrates features to simplify system design and provide customers wide range of comprehensive and superior cost effective MCU portfolios with proven technology and great innovation.
GD32 family includes entry line, performance line and connectivity line currently.
       </description>
      <feature type="XTAL"               n="3000000"  m="25000000"  name="Crystal Oscillator"/>
      <feature type="CoreOther"       n="1"                                        name="CRC Calculation Unit"/>
      <feature type="DMA"               n="7"                                         name="General Purpose DMA with Centralized FIFO and Burst Support"/>
      <feature type="IntRC"              n="8000000"                            name="Internal 8M RC oscillator"/>  
      <feature type="IntRC"              n="40000"                                name="Internal 8M RC oscillator"/>    
      <feature type="RTC"                n="32000"                                 name="RTC with 32 kHz calibrated Oscillator and Battery Backup"/>
      <feature type="PLL"                 n="3"                                         name="Internal PLL"/>
      <feature type="PowerMode"    n="4"                                          name="Run, Sleep, Deep-Sleep, Standby"/>
      <feature type="PowerOther"    n="1"                                          name="POR, PDR, LVD, and BPOR"/>
      <feature type="ExtInt"             n="20"                                        name="External interrupt"/>            
      <feature type="Temp"             n="-40"          m="85"                name="Extended Operating Temperature Range"/>
      <feature type="ADC"               n="3"              m="24"                name="High-Performance ADC"/>
      <feature type="TempSens"      n="1"                                          name="Temperature sensor"/>
      <feature type="Timer"             n="10"              m="16"              name="16-bit General Purpose Timer"/>
      <feature type="Timer"             n="2"              m="16"                name="Advanced Timer"/>
      <feature type="Timer"             n="2"              m="16"                name="Basic Timer"/>
      <feature type="Timer"             n="1"              m="24"                name="SysTick Timer"/>
      <feature type="WDT"               n="2"                                          name="Watchdog timer"/>
      <feature type="MPSerial"         n="4"                                          name="Multi-Purpose Serial Interface Module: I2C, I2S, SPI, USART"/> 
      <feature type="USART"            n="4"              m="7500000"     name="High-Speed USART Interface"/>
      <feature type="UART"              n="4"              m="7500000"     name="High-Speed UART Interface"/>
      <feature type="CAN"               n="2"                                          name="CAN 2.0b Controller"/>
      <feature type="ETH"                n="1"              m="100000000"  name="Integrated Ethernet MAC with PHY"/>
      <feature type="USBOTG"          n="1"                                          name="High-Speed/Full-Speed USB OTG with PHY"/>
      <feature type="GLCD"              n="2"              m="2048.2048"   name="TFT LCD Controller"/>
      <feature type="RNG"                n="1"                                          name="True Random Number Generator"/>
      <feature type="SDIO"               n="1"              m="8"                  name="SDIO Interface"/>
      <feature type="Camera"           n="1"              m="14"                name="Digital Camera Interface"/>
      <feature type="IOs"                 n="140"                                       name="IO pins"/>
      <feature type="I2C"                 n="3"                                           name="Low-Power I2C"/>
      <feature type="SPI"                  n="3"                                          name="SPI Interface"/>
      <feature type="I2S"                  n="2"                                          name="I2S Interface"  />
      <feature type="VCC"                n="2.6"                m="3.6"          name="Voltage"/>
      <feature type="NVIC"               n="90"                                        name="NVIC"/>
      <feature type="Other"              n="4"                                         name="My other Interface"/>

