vvpai9/Keil/Keil_v5/ARM/Pack/.Web/GigaDevice.GD32F20x_DFP.pdsc
<!-- ************************  Subfamily 'GD32F205'  **************************** -->
      <subFamily DsubFamily="GD32F205">
        <processor Dclock="120000000"/>
         <compile header="Device/Include/gd32f20x.h" define="GD32F20X_CL"/>
        <debug svd="SVD/GD32F20x_CL.svd"/>
        <description>
        GD32F205 - ARM Cortex-M3 Core
          Frequency up to 120 MHz
          Flash access zero wait state
          Single-cycle multiplier and hardware divider

        Memories
          Flash size from 128 KB to 3072 KB
          SRAM size is 256 KB with HW parity checking
          18 KB ISP loader ROM
        </description>

        <!-- *************************  Device 'GD32F205RC  ***************************** -->
        <device Dname="GD32F205RC">
          <memory    id="IROM1"                   start="0x08000000" size="0x040000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x020000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F20x_CL.FLM" start="0x08000000" size="0x040000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F205RE  ***************************** -->
        <device Dname="GD32F205RE">
          <memory    id="IROM1"                   start="0x08000000" size="0x080000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x020000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F20x_CL.FLM" start="0x08000000" size="0x080000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F205RG  ***************************** -->
        <device Dname="GD32F205RG">
          <memory    id="IROM1"                   start="0x08000000" size="0x0100000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x040000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F20x_CL.FLM" start="0x08000000" size="0x0100000" default="1"/>
        </device>
      
       <!-- *************************  Device 'GD32F205RK  ***************************** -->
        <device Dname="GD32F205RK">
          <memory    id="IROM1"                   start="0x08000000" size="0x0300000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x040000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F20x_CL.FLM" start="0x08000000" size="0x0300000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F205VC  ***************************** -->
        <device Dname="GD32F205VC">
          <memory    id="IROM1"                   start="0x08000000" size="0x040000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x020000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F20x_CL.FLM" start="0x08000000" size="0x040000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F205VE  ***************************** -->
        <device Dname="GD32F205VE">
          <memory    id="IROM1"                   start="0x08000000" size="0x080000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x020000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F20x_CL.FLM" start="0x08000000" size="0x080000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F205VG  ***************************** -->
        <device Dname="GD32F205VG">
          <memory    id="IROM1"                   start="0x08000000" size="0x0100000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x020000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F20x_CL.FLM" start="0x08000000" size="0x0100000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F205VK  ***************************** -->
        <device Dname="GD32F205VK">
          <memory    id="IROM1"                   start="0x08000000" size="0x0300000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x040000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F20x_CL.FLM" start="0x08000000" size="0x0300000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F205ZC  ***************************** -->
        <device Dname="GD32F205ZC">
          <memory    id="IROM1"                   start="0x08000000" size="0x040000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x020000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F20x_CL.FLM" start="0x08000000" size="0x040000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F205ZE  ***************************** -->
        <device Dname="GD32F205ZE">
          <memory    id="IROM1"                   start="0x08000000" size="0x080000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x020000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F20x_CL.FLM" start="0x08000000" size="0x080000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F205ZG  ***************************** -->
        <device Dname="GD32F205ZG">
          <memory    id="IROM1"                   start="0x08000000" size="0x0100000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x040000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F20x_CL.FLM" start="0x08000000" size="0x0100000" default="1"/>
        </device>

       <!-- *************************  Device 'GD32F205ZK  ***************************** -->
        <device Dname="GD32F205ZK">
          <memory    id="IROM1"                   start="0x08000000" size="0x0300000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x040000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F20x_CL.FLM" start="0x08000000" size="0x0300000" default="1"/>
        </device>

      </subFamily>

 <!-- ************************  Subfamily 'GD32F207'  **************************** -->
      <subFamily DsubFamily="GD32F207">
        <processor Dclock="120000000"/>
         <compile header="Device/Include/gd32f20x.h" define="GD32F20X_CL"/>
        <debug svd="SVD/GD32F20x_CL.svd"/>
        <description>
        GD32F207 - ARM Cortex-M3 Core
          Frequency up to 120 MHz
          Flash access zero wait state
          Single-cycle multiplier and hardware divider

        Memories
          Flash size from 256 KB to 3072 KB
          SRAM size is 256 KB with HW parity checking
          18 KB ISP loader ROM
        </description>

