vvpai9/Keil/Keil_v5/ARM/Pack/.Web/GigaDevice.GD32F20x_DFP.pdsc
        <!-- *************************  Device 'GD32F207RC  ***************************** -->
        <device Dname="GD32F207RC">
          <memory    id="IROM1"                   start="0x08000000" size="0x040000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x020000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F20x_CL.FLM" start="0x08000000" size="0x040000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F207RE  ***************************** -->
        <device Dname="GD32F207RE">
          <memory    id="IROM1"                   start="0x08000000" size="0x080000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x020000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F20x_CL.FLM" start="0x08000000" size="0x080000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F207RG  ***************************** -->
        <device Dname="GD32F207RG">
          <memory    id="IROM1"                   start="0x08000000" size="0x0100000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x040000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F20x_CL.FLM" start="0x08000000" size="0x0100000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F207RK  ***************************** -->
        <device Dname="GD32F207RK">
          <memory    id="IROM1"                   start="0x08000000" size="0x0300000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x040000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F20x_CL.FLM" start="0x08000000" size="0x0300000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F207VC  ***************************** -->
        <device Dname="GD32F207VC">
          <memory    id="IROM1"                   start="0x08000000" size="0x040000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x020000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F20x_CL.FLM" start="0x08000000" size="0x040000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F207VE  ***************************** -->
        <device Dname="GD32F207VE">
          <memory    id="IROM1"                   start="0x08000000" size="0x080000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x020000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F20x_CL.FLM" start="0x08000000" size="0x080000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F207VG  ***************************** -->
        <device Dname="GD32F207VG">
          <memory    id="IROM1"                   start="0x08000000" size="0x0100000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x040000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F20x_CL.FLM" start="0x08000000" size="0x0100000" default="1"/>
        </device>

       <!-- *************************  Device 'GD32F207VK  ***************************** -->
        <device Dname="GD32F207VK">
          <memory    id="IROM1"                   start="0x08000000" size="0x0300000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x040000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F20x_CL.FLM" start="0x08000000" size="0x0300000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F207ZC  ***************************** -->
        <device Dname="GD32F207ZC">
          <memory    id="IROM1"                   start="0x08000000" size="0x040000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x020000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F20x_CL.FLM" start="0x08000000" size="0x040000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F207ZE  ***************************** -->
        <device Dname="GD32F207ZE">
          <memory    id="IROM1"                   start="0x08000000" size="0x080000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x020000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F20x_CL.FLM" start="0x08000000" size="0x080000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F207ZG  ***************************** -->
        <device Dname="GD32F207ZG">
          <memory    id="IROM1"                   start="0x08000000" size="0x0100000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x040000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F20x_CL.FLM" start="0x08000000" size="0x0100000" default="1"/>
        </device>
      
        <!-- *************************  Device 'GD32F207ZK  ***************************** -->
        <device Dname="GD32F207ZK">
          <memory    id="IROM1"                   start="0x08000000" size="0x0300000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x040000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F20x_CL.FLM" start="0x08000000" size="0x0300000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F207IE  ***************************** -->
        <device Dname="GD32F207IE">
          <memory    id="IROM1"                   start="0x08000000" size="0x080000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x020000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F20x_CL.FLM" start="0x08000000" size="0x080000" default="1"/>
        </device>

