vvpai9/Keil/Keil_v5/ARM/Pack/.Web/GigaDevice.GD32F20x_DFP.pdsc
        <!-- *************************  Device 'GD32F207IG  ***************************** -->
        <device Dname="GD32F207IG">
          <memory    id="IROM1"                   start="0x08000000" size="0x0100000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x040000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F20x_CL.FLM" start="0x08000000" size="0x0100000" default="1"/>
        </device>
      
        <!-- *************************  Device 'GD32F207IK  ***************************** -->
        <device Dname="GD32F207IK">
          <memory    id="IROM1"                   start="0x08000000" size="0x0300000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x040000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F20x_CL.FLM" start="0x08000000" size="0x0300000" default="1"/>
        </device>

      </subFamily>
    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="GD32F20xCL">
      <description>GigaDevice GD32F20x Devices</description>
      <require Dvendor="GigaDevice:123" Dname="GD32F20[57]*"/>
      <require Cclass="Device" Cgroup="Startup" />
    </condition>

   <!-- Device + CMSIS Conditions -->
    <condition id="GD32F20x CMSIS">
      <description>GigaDevice GD32F20x Devices and CMSIS-CORE</description>
      <accept condition="GD32F20xCL"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="GD32F20x_libopt"/>    
      <require Cclass="Device" Cgroup="GD32F20x_StdPeripherals" Csub="RCU"/>           
      <require Cclass="Device" Cgroup="GD32F20x_StdPeripherals" Csub="PMU"/>    
    </condition>
    <!-- GD32F20x STDPERIPHERALS RCU Conditions -->
    <condition id="GD32F20x STDPERIPHERALS RCU">
      <description>GigaDevice  GD32F20x Standard Peripherals Drivers with RCU</description>
      <require condition="GD32F20x CMSIS"/>
      <require Cclass="Device" Cgroup="GD32F20x_StdPeripherals" Csub="RCU"/>
    </condition>

     <!-- GD32F20x STDPERIPHERALS MISC Conditions -->
    <condition id="GD32F20x STDPERIPHERALS MISC">
      <description>GigaDevice  GD32F20x Standard Peripherals Drivers with MISC</description>
      <require condition="GD32F20x CMSIS"/>
      <require Cclass="Device" Cgroup="GD32F20x_StdPeripherals" Csub="MISC"/>
    </condition>

     <!-- GD32F20x STDPERIPHERALS EVAL Conditions -->
    <condition id="GD32F20x STDPERIPHERALS EVAL">
      <description>GigaDevice  GD32F20x Standard Peripherals Drivers with EVAL</description>
      <require condition="GD32F20x CMSIS"/>
      <require Cclass="Device" Cgroup="GD32F20x_StdPeripherals" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="GD32F20x_StdPeripherals" Csub="EXTI"/>
      <require Cclass="Device" Cgroup="GD32F20x_StdPeripherals" Csub="USART"/>
    </condition>
  </conditions>

  <components>
    <!-- GD32F20x_StdPeripherals -->
    <component Cclass="Device" Cgroup="GD32F20x_StdPeripherals" Csub="ADC" Cversion="2.2.2" condition="GD32F20x STDPERIPHERALS RCU">
      <description>Analog-to-digital converter (ADC) driver for GD32F20x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_ADC
        </RTE_Components_h>
        <files>
          <!-- ADC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f20x_adc.h"/>
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f20x_adc.c" attr="config" version="2.2.2" />
        </files>
    </component>

   <component Cclass="Device" Cgroup="GD32F20x_StdPeripherals" Csub="BKP" Cversion="2.2.2" condition="GD32F20x STDPERIPHERALS RCU">
      <description>Backup register(BKP) driver for GD32F20x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_BKP
        </RTE_Components_h>
        <files>
          <!-- BKP flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f20x_bkp.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f20x_bkp.c" attr="config" version="2.2.2" />
        </files>
    </component>

    <component Cclass="Device" Cgroup="GD32F20x_StdPeripherals" Csub="CAN" Cversion="2.2.2" condition="GD32F20x STDPERIPHERALS RCU">
      <description>Controller Area Network (CAN) driver for GD32F20x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CAN
        </RTE_Components_h>
        <files>
          <!-- CAN flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f20x_can.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f20x_can.c" attr="config" version="2.2.2" />
        </files>
    </component>

   <component Cclass="Device" Cgroup="GD32F20x_StdPeripherals" Csub="CAU" Cversion="2.2.2" condition="GD32F20x STDPERIPHERALS RCU">
      <description>Crytographic acceleration unit (CAU) driver for GD32F20x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CAU
        </RTE_Components_h>
        <files>
          <!-- CAN flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f20x_cau.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f20x_cau.c" attr="config" version="2.2.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F20x_StdPeripherals" Csub="CRC" Cversion="2.2.2" condition="GD32F20x STDPERIPHERALS RCU">
      <description>Cyclic Redundancy Check (CRC) driver for GD32F20x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CRC
        </RTE_Components_h>
        <files>
          <!-- CRC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f20x_crc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f20x_crc.c" attr="config" version="2.2.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F20x_StdPeripherals" Csub="DAC" Cversion="2.2.2" condition="GD32F20x STDPERIPHERALS RCU">
      <description>Digital-to-analog converter (DAC) driver for GD32F20x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DAC
        </RTE_Components_h>
        <files>
          <!-- DAC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f20x_dac.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f20x_dac.c" attr="config" version="2.2.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F20x_StdPeripherals" Csub="DBG" Cversion="2.2.2" condition="GD32F20x STDPERIPHERALS RCU">
      <description>Debug (DBG) driver for GD32F20x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DBG
        </RTE_Components_h>
        <files>
          <!-- DBG flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f20x_dbg.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f20x_dbg.c" attr="config" version="2.2.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F20x_StdPeripherals" Csub="DCI" Cversion="2.2.2" condition="GD32F20x STDPERIPHERALS RCU">
      <description>Digital camera interface (DCI) driver for GD32F20x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DCI
        </RTE_Components_h>
        <files>
          <!-- DAC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f20x_dci.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f20x_dci.c" attr="config" version="2.2.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F20x_StdPeripherals" Csub="DMA" Cversion="2.2.2" condition="GD32F20x STDPERIPHERALS RCU">
      <description>Direct Memory Access (DMA) driver for GD32F20x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DMA
        </RTE_Components_h>
        <files>
          <!-- DMA flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f20x_dma.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f20x_dma.c" attr="config" version="2.2.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F20x_StdPeripherals" Csub="ENET" Cversion="2.2.2" condition="GD32F20x STDPERIPHERALS RCU">
      <description>Ethernet(ENET) driver for GD32F20x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_ENET
        </RTE_Components_h>
        <files>
          <!-- ENET flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f20x_enet.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f20x_enet.c" attr="config" version="2.2.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F20x_StdPeripherals" Csub="EXMC" Cversion="2.2.2" condition="GD32F20x STDPERIPHERALS RCU">
      <description>External memory controller(EXMC) driver for GD32F20x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_EXMC
        </RTE_Components_h>
        <files>
          <!-- EXMC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f20x_exmc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f20x_exmc.c" attr="config" version="2.2.2" />
        </files>
    </component>

