vvpai9/Keil/Keil_v5/ARM/Pack/.Web/GigaDevice.GD32F20x_DFP.pdsc
  <component Cclass="Device" Cgroup="GD32F20x_StdPeripherals" Csub="EXTI" Cversion="2.2.2" condition="GD32F20x STDPERIPHERALS RCU">
      <description>External Interrupt/Event (EXTI) driver for GD32F20x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_EXTI
        </RTE_Components_h>
        <files>
          <!-- EXTI flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f20x_exti.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f20x_exti.c" attr="config" version="2.2.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F20x_StdPeripherals" Csub="FMC" Cversion="2.2.2" condition="GD32F20x STDPERIPHERALS RCU">
      <description>Flash Memory Controller (FMC) driver for GD32F20x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_FMC
        </RTE_Components_h>
        <files>
          <!-- FMC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f20x_fmc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f20x_fmc.c" attr="config" version="2.2.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F20x_StdPeripherals" Csub="FWDGT" Cversion="2.2.2" condition="GD32F20x STDPERIPHERALS RCU">
      <description>Free watchdog timer(FWDGT) driver for GD32F20x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_FWDGT
        </RTE_Components_h>
        <files>
          <!-- FWDGT flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f20x_fwdgt.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f20x_fwdgt.c" attr="config" version="2.2.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F20x_StdPeripherals" Csub="GPIO" Cversion="2.2.2" condition="GD32F20x STDPERIPHERALS RCU">
      <description>General-purpose and Alternate-function I/Os (GPIO) driver for GD32F20x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_GPIO
        </RTE_Components_h>
        <files>
          <!-- GPIO flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f20x_gpio.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f20x_gpio.c" attr="config" version="2.2.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F20x_StdPeripherals" Csub="HAU" Cversion="2.2.2" condition="GD32F20x STDPERIPHERALS RCU">
      <description>Hash Acceleration unit (HAU) driver for GD32F20x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_HAU
        </RTE_Components_h>
        <files>
          <!-- GPIO flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f20x_hau.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f20x_hau.c" attr="config" version="2.2.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F20x_StdPeripherals" Csub="I2C" Cversion="2.2.2" condition="GD32F20x STDPERIPHERALS RCU">
      <description>Inter-integrated Circuit (I2C) driver for GD32F20x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_I2C
        </RTE_Components_h>
        <files>
          <!-- I2C flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f20x_i2c.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f20x_i2c.c" attr="config" version="2.2.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F20x_StdPeripherals" Csub="MISC" Cversion="2.2.2" condition="GD32F20x CMSIS">
      <description>MISC driver for GD32F20x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_MISC
        </RTE_Components_h>
        <files>
          <!-- MISC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f20x_misc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f20x_misc.c" attr="config" version="2.2.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F20x_StdPeripherals" Csub="PMU" Cversion="2.2.2" condition="GD32F20x STDPERIPHERALS RCU">
      <description>Power Managment Unit(PMU) driver for GD32F20x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_PMU
        </RTE_Components_h>
        <files>
          <!-- PMU flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f20x_pmu.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f20x_pmu.c" attr="config" version="2.2.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F20x_StdPeripherals" Csub="RCU" Cversion="2.2.2" condition="GD32F20x STDPERIPHERALS MISC">
      <description>Reset and Clock Control (RCU) driver for GD32F20x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_RCU
        </RTE_Components_h>
        <files>
          <!-- RCU flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f20x_rcu.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f20x_rcu.c" attr="config" version="2.2.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F20x_StdPeripherals" Csub="RTC" Cversion="2.2.2" condition="GD32F20x STDPERIPHERALS RCU">
      <description>Real-time Clock (RTC) driver for GD32F20x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_RTC
        </RTE_Components_h>
        <files>
          <!-- RTC flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f20x_rtc.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f20x_rtc.c" attr="config" version="2.2.2" />
        </files>
    </component>

