vvpai9/Keil/Keil_v5/ARM/Pack/.Web/GigaDevice.GD32F20x_DFP.pdsc
  <component Cclass="Device" Cgroup="GD32F20x_StdPeripherals" Csub="SDIO" Cversion="2.2.2" condition="GD32F20x STDPERIPHERALS RCU">
      <description>Secure digital input/output interface(SDIO) driver for GD32F20x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SDIO
        </RTE_Components_h>
        <files>
          <!-- SDIO flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f20x_sdio.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f20x_sdio.c" attr="config" version="2.2.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F20x_StdPeripherals" Csub="SPI_I2S" Cversion="2.2.2" condition="GD32F20x STDPERIPHERALS RCU">
      <description>Serial Peripheral Interface / Inter-IC Sound (SPI_I2S) driver for GD32F20x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SPI
        </RTE_Components_h>
        <files>
          <!-- SPI flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f20x_spi.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f20x_spi.c" attr="config" version="2.2.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F20x_StdPeripherals" Csub="TIMER" Cversion="2.2.2" condition="GD32F20x STDPERIPHERALS RCU">
      <description>TIMER driver for GD32F20x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_TIMER
        </RTE_Components_h>
        <files>
          <!-- TIMER flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f20x_timer.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f20x_timer.c" attr="config" version="2.2.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F20x_StdPeripherals" Csub="TLI" Cversion="2.2.2" condition="GD32F20x STDPERIPHERALS RCU">
      <description>TFT-LCD interface (TLI) driver for GD32F20x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_TLI
        </RTE_Components_h>
        <files>
          <!-- TIMER flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f20x_tli.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f20x_tli.c" attr="config" version="2.2.2" />
        </files>
    </component>

 <component Cclass="Device" Cgroup="GD32F20x_StdPeripherals" Csub="TRNG" Cversion="2.2.2" condition="GD32F20x STDPERIPHERALS RCU">
      <description>True random number generator (TRNG) driver for GD32F20x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_TRNG
        </RTE_Components_h>
        <files>
          <!-- TIMER flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f20x_trng.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f20x_trng.c" attr="config" version="2.2.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F20x_StdPeripherals" Csub="USART" Cversion="2.2.2" condition="GD32F20x STDPERIPHERALS RCU">
      <description>Universal Synchronous Asynchronous Receiver Transmitter (USART) driver for GD32F20x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_USART
        </RTE_Components_h>
        <files>
          <!-- USART flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f20x_usart.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f20x_usart.c" attr="config" version="2.2.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F20x_StdPeripherals" Csub="WWDGT" Cversion="2.2.2" condition="GD32F20x STDPERIPHERALS RCU">
      <description>Window Watchdog Timer (WWDGT) driver for GD32F20x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_WWDGT
        </RTE_Components_h>
        <files>
          <!-- WWDGT flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f20x_wwdgt.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f20x_wwdgt.c" attr="config" version="2.2.2" />
        </files>
    </component>

    <!-- Utilities GD32F20x -->
    <component Cclass="Device" Cgroup="EVAL" Csub="GD32F207i" Cversion="2.2.2" condition="GD32F20x STDPERIPHERALS EVAL">
      <description>Firmware functions to manage Leds, Keys, COM ports for GD32F207i eval board</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/Utilities/gd32f20x_eval.h" />
        <!-- eval file -->
        <file category="source" name="Device/Utilities/gd32f20x_eval.c" attr="config" version="2.2.2"/>
      </files>
    </component>

    <!-- Config GD32F20x -->
    <component Cclass="Device" Cgroup="GD32F20x_libopt" Cversion="2.2.2" condition="GD32F20x CMSIS">
      <description>Configuration file</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/Include/gd32f20x_libopt.h"/>
      </files>
    </component>

   <!-- Startup GD32F20x CL -->
    <component Cclass="Device" Cgroup="Startup"   Cversion="2.2.2" condition="GD32F20xCL">
      <description>System Startup for GigaDevice GD32F205 and GD32F207 Devices</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device/Include/"/>
        <file category="header" name="Device/Include/gd32f20x.h"/>
        <!-- startup file -->
        <file category="source" name="Device/Source/ARM/startup_gd32f20x_cl.s" attr="config" version="2.2.2" condition="Compiler ARMCC"/>
        <!-- system file -->
        <file category="source" name="Device/Source/system_gd32f20x.c"      attr="config" version="2.2.2"/>
      </files>
    </component>
  </components>
</package>
